src/cf/Documents/GDS_МестонахождениеТехники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>GDS_МестонахождениеТехники</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СторонняяТехника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месторождение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GDS_Месторождения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Куст</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.GDS_Кусты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВходВГеозону</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыходИзГеозоны</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВГеозоне</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОшибки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьОшибки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СколькоТопливаПотрачено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МотоЧасы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ID_Автограф</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПУ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/GDS_МестонахождениеТехники_ПравилаЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>GDS_МестонахождениеТехники_ПравилаЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НаименованиеЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЗагружаемогоЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.GDS_ТипЗагружаемогоЭлемента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Documents/GDS_МестонахождениеТехники/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Функция ВернутьМашину(ГосНомер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатТС.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.уатТС КАК уатТС
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА СТРНАЙТИ(уатТС.ГосударственныйНомер, ""g-"") >= 1
	               |				ТОГДА СТРЗАМЕНИТЬ(уатТС.ГосударственныйНомер, ""g-"", """") = &ГосНомер
	               |			ИНАЧЕ уатТС.ГосударственныйНомер = &ГосНомер
	               |		КОНЕЦ";
	Запрос.УстановитьПараметр("ГосНомер", ГосНомер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.уатТС.ПустаяСсылка();
	КонецЕсли;
	
	
	//Возврат Справочники.уатТС.НайтиПоРеквизиту("ГосударственныйНомер",ГосНомер);
	
КонецФункции

&НаСервере
Функция ВернутьЭлементМесторождение(ВхЭлемент)
	
	Месторождение = Справочники.GDS_Месторождения.ПустаяСсылка();
	
	ОтборМесторождения = Новый Структура;
	ОтборМесторождения.Вставить("Наименование", ВРег(ВхЭлемент));
	
	МассивСтрок = ТЧ_Месторождений.НайтиСтроки(ОтборМесторождения);
	Если МассивСтрок.Количество() > 0 Тогда
		Месторождение = МассивСтрок[0].Месторождение;
	КонецЕсли;
	
	Возврат Месторождение;
	
КонецФункции

&НаСервере
Функция ПолучитьМесторождения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	GDS_Месторождения.Ссылка КАК Месторождение,
	|	GDS_Месторождения.Наименование КАК Наименование
	|ИЗ
	|	Справочник.GDS_Месторождения КАК GDS_Месторождения
	|ГДЕ
	|	НЕ GDS_Месторождения.ПометкаУдаления";
	
	ТЧ_Данные = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр из ТЧ_Данные Цикл
		Стр.Наименование = ВРег(Стр.Наименование);		
	КонецЦикла;
	
	Возврат ТЧ_Данные;

КонецФункции

&НаСервере
Функция ВернутьЭлементКуст(ВхЭлемент,Владелец)
	
	Куст = Справочники.GDS_Кусты.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	GDS_Кусты.Ссылка
	               |ИЗ
	               |	Справочник.GDS_Кусты КАК GDS_Кусты
	               |ГДЕ
	               |	GDS_Кусты.Наименование = &Наименование
	               |	И GDS_Кусты.Владелец = &Владелец
	               |	И НЕ GDS_Кусты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Наименование", ВхЭлемент);
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Куст = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Возврат Куст;	
	
КонецФункции

&НаСервере
Функция СоздатьНовыйКуст(Куст,Месторождение)
	
	СтрЭлемент = Справочники.GDS_Кусты.СоздатьЭлемент();
	
	СтрЭлемент.Наименование = Куст;
	СтрЭлемент.Владелец = Месторождение;
	
	СтрЭлемент.Записать();
	
	Возврат Справочники.GDS_Кусты.НайтиПоНаименованию(Куст,ИСТИНА,Месторождение);
	
КонецФункции

&НаСервере
Функция ПрочитатьExcel(ФайлExcel, ФункцияОбработкиСтрок = "СокрЛП(?)",
	
	ОграничиватьСверху = Истина, ОграничиватьСлева = Истина, ОграничиватьСнизу = Истина, ОграничиватьСправа = Истина) Экспорт 
	
	Ф = ФайлExcel;
	ВесьТабДок = Новый ТабличныйДокумент();
	ВесьТабДок.Прочитать(Ф, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	
	Результат = Новый СписокЗначений;
	Области = ВесьТабДок.Области;
	
	Если Области.Количество()=0 Тогда 
		ВызватьИсключение("В файле нет областей");
	КонецЕсли;
	
	Для Каждого Обл Из Области Цикл
		ТекТабДок = Новый ТабличныйДокумент;
		ОгрОбласть = ПолучитьОграниченнуюОбласть(ВесьТабДок, Обл);
		// вставим область в табдок
		ОгрОбласть.Имя = Обл.Имя;
		ТекТабДок.ВставитьОбласть(ОгрОбласть, 
		ТекТабДок.Область(1, ОгрОбласть.Лево, ОгрОбласть.Низ - ОгрОбласть.Верх + 1, ОгрОбласть.Право)
		);
		СократитьСтроки(ТекТабДок, ФункцияОбработкиСтрок);
		Результат.Добавить(ТекТабДок, Обл.Имя);
	КонецЦикла;
	// зачищаем исходный таб док. хз, может лишнее
	ВесьТабДок.Очистить();
	ВесьТабДок = Неопределено;
	
	Возврат Результат;
	
КонецФункции

Процедура СократитьСтроки(ТабДок, ФункцияОбработкиСтрок = "СокрЛП(?)")
	
	Если ПустаяСтрока(ФункцияОбработкиСтрок) Тогда 
		Возврат;
	КонецЕсли;
	
	Если Ложь Тогда ТабДок = Новый ТабличныйДокумент; КонецЕсли; // фейк
	
	Для Стр = 1 По ТабДок.ВысотаТаблицы Цикл 
		Для Кол = 1 По ТабДок.ШиринаСтраницы Цикл 
			ТекОбласть = ТабДок.Область(Стр, Кол);
			ТекстОбласти = ТекОбласть.Текст;
			
			Если Не ТекОбласть.СодержитЗначение И Не ПустаяСтрока(ТекОбласть.Текст)    Тогда 
				Выражение = СтрЗаменить(ФункцияОбработкиСтрок, "?", "ТекстОбласти");
				ТекОбласть.Текст = Вычислить(Выражение);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОграниченнуюОбласть(ТабДок, ОбластьЯчеек,
	
	ОграничиватьСверху = Истина, ОграничиватьСлева = Истина, ОграничиватьСнизу = Истина, ОграничиватьСправа = Истина)
	
	Если Не ОграничиватьСверху И Не ОграничиватьСлева И Не ОграничиватьСправа И Не ОграничиватьСнизу Тогда 
		Возврат ОбластьЯчеек;
	КонецЕсли;
	
	Если Ложь Тогда // фейк
		ТабДок = Новый ТабличныйДокумент;
		ОбластьЯчеек = ТабДок.Области[0];
	КонецЕсли;
	
	Лево = Неопределено; Право = Неопределено; Верх = Неопределено; Низ = Неопределено;
	МаксШирина = ТабДок.ШиринаТаблицы;
	
	Для Стр = ОбластьЯчеек.Верх По ОбластьЯчеек.Низ Цикл
		Для Кол = 1 По МаксШирина Цикл 
			ТекОбласть = ТабДок.Область(Стр, Кол);
			
			Если ЭтоЗначащаяОбласть(ТекОбласть) Тогда 
				Лево 	= ?(Лево=Неопределено, Кол, Мин(Лево, Кол));
				Право 	= ?(Право=Неопределено, Кол, Макс(Право, Кол));
				Верх 	= ?(Верх=Неопределено, Стр, Верх);
				Низ 	= ?(Низ=Неопределено, Стр, Макс(Низ, Стр));
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Результат = ТабДок.Область(?(ОграничиватьСверху, ?(Верх=Неопределено, ОбластьЯчеек.Верх, Верх), ОбластьЯчеек.Верх),
								?(ОграничиватьСлева, ?(Лево=Неопределено, ОбластьЯчеек.Лево, Лево), ОбластьЯчеек.Лево),
								?(ОграничиватьСнизу, ?(Низ=Неопределено, ОбластьЯчеек.Низ, Низ), ОбластьЯчеек.Низ),
								?(ОграничиватьСправа, ?(Право=Неопределено, ОбластьЯчеек.Право, Право), ОбластьЯчеек.Право));
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоЗначащаяОбласть(ОбластьЯчеек)
	
	Возврат Не ПустаяСтрока(ОбластьЯчеек.Текст) 
		Или ОбластьЯчеек.Гиперссылка
		Или ОбластьЯчеек.СодержитЗначение
		Или ОбластьЯчеек.ГраницаСлева.ТипЛинии <> ТипЛинииЯчейкиТабличногоДокумента.НетЛинии
		Или ОбластьЯчеек.ГраницаСправа.ТипЛинии <> ТипЛинииЯчейкиТабличногоДокумента.НетЛинии;
	
КонецФункции

&НаСервере
Процедура ЗагрузкаИнформацииНаСервере(Адрес)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(Адрес);
	ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
	ДвоичныеДанные.Записать(ИмяФайла);
	
	ЗначениеЗагрузки = ПрочитатьExcel(ИмяФайла);
	
	ТабД = ЗначениеЗагрузки[0].Значение;
	
	КолВоСтрок = ТабД.ВысотаТаблицы;
	
	ТЧ_Месторождений.Очистить();
	ТЧ_Месторождений.Загрузить(ПолучитьМесторождения());
	
	Сч =0;
	Для Стр = 7 по КолВоСтрок Цикл
		СтруктураОшибок = Новый Структура;
		СтруктураОшибок.Вставить("ТекстОшибки","");
		
		Если ЗначениеЗаполнено(ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(3,"ЧГ=")).Текст) Тогда //Модель
			Модель = ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(3,"ЧГ=")).Текст;
		Иначе
			Модель = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(4,"ЧГ=")).Текст) Тогда //ID_Автограф для связи машин
			ID_Автограф = ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(4,"ЧГ=")).Текст;
		Иначе
			ID_Автограф = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(5,"ЧГ=")).Текст) Тогда //Номер ТС
			НомерТС = ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(5,"ЧГ=")).Текст;
		Иначе
			НомерТС = "";
		КонецЕсли;
	
		Если ЗначениеЗаполнено(ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(6,"ЧГ=")).Текст) Тогда //Название геозоны
			НазваниеГеозоны = ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(6,"ЧГ=")).Текст;
		Иначе
			НазваниеГеозоны = "";
		КонецЕсли;
		
		//+время
		Если ЗначениеЗаполнено(ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(7,"ЧГ=")).Текст) Тогда//Вход в геозону
			ВремяВхода = ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(7,"ЧГ=")).Текст;
		Иначе
			ВремяВхода = "00010101000000";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(8,"ЧГ=")).Текст) Тогда//Выход из геозоны
			ВремяВыхода = ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(8,"ЧГ=")).Текст;
		Иначе
			ВремяВыхода = "00010101000000";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(9,"ЧГ=")).Текст) Тогда//Время в геозоне (чч:мм)
			ВремяВГеозоне = ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(9,"ЧГ=")).Текст;
			
			// Добавлено условие чтобы исключить фальшивые остановки по данным автографа - Просьба МакароваЭ.В., лопушенко в курсе
			//из-за этого условия строчек в программе становится меньше чем в файле
			Если Число(Лев(ВремяВГеозоне,2)) > 0 Тогда
			Иначе
				Если Число(Прав(ВремяВГеозоне,2)) < 10 Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
		Иначе
			ВремяВГеозоне = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(11,"ЧГ=")).Текст) Тогда//Расход топлива (чч:мм)
			РасходТоплива = ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(11,"ЧГ=")).Текст;
			
			Если Число(РасходТоплива) < 0 Тогда
				РасходТоплива = 0;
			КонецЕсли;
		Иначе
			РасходТоплива = "";
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(12,"ЧГ=")).Текст) Тогда//М\Ч
			МотоЧасы = ТабД.Область("R"+Формат(Стр,"ЧГ=")+"C"+Формат(12,"ЧГ=")).Текст;
		КонецЕсли;
		//-
		Если Не НазваниеГеозоны = "" Тогда
			Месторождение = "";
			Куст = "";
			База = "";
			
			Сч = Сч+1;
			МассивСтрок = СтрРазделить(НазваниеГеозоны,",");
			РезультатПроверки = ПроверкаМассиваСтрокНаДвойныеКусты(МассивСтрок);
			
			Если РезультатПроверки.Кусты <> "" Тогда
				Сообщить("Строка № "+сч+" в Excel найдены дубли кустов"+РезультатПроверки.Кусты+" по Месторождению - "+РезультатПроверки.Месторождение);
				СтруктураОшибок.ТекстОшибки = СтруктураОшибок.ТекстОшибки +"Строка № "+сч+" В Excel найдены дубли кустов - "+РезультатПроверки.Кусты+" по Месторождению - "+РезультатПроверки.Месторождение;
			КонецЕсли;
			
			Для СтрМассива = 0 по МассивСтрок.Количество() - 1 Цикл
				СтрМасс = МассивСтрок[СтрМассива];
				
				Если Найти(СокрЛП(СтрМасс),"База") > 0 Тогда
					База = СокрЛП(Лев(СокрЛП(СтрМасс),СтрДлина(СокрЛП(СтрМасс))));
				КонецЕсли;		
				
				Если Найти(СокрЛП(СтрМасс),"м/р") > 0 Тогда
					Местор = СокрЛП(Лев(СокрЛП(СтрМасс),СтрДлина(СокрЛП(СтрМасс))-4));
					Месторождение = ВернутьЭлементМесторождение(Местор);
					
					Если НЕ ЗначениеЗаполнено(Месторождение) Тогда
						Сообщить("Строка № "+сч+" месторождения нет в БД - "+Местор);
						СтруктураОшибок.ТекстОшибки = СтруктураОшибок.ТекстОшибки +"Строка № "+сч+" Месторождения нет в БД - "+Местор;// + Символы.ПС;
					КонецЕсли;
				КонецЕсли;
				
				Если Найти(СокрЛП(СтрМасс),"К-") > 0 Тогда
					Куст = Прав(СокрЛП(СтрМасс),СтрДлина(СокрЛП(СтрМасс))-2);
				КонецЕсли;
			КонецЦикла;
			
			НоваяСтрока = Объект.ТЧ.Добавить();
			
			НоваяСтрока.База = База;
			
			НоваяСтрока.ВходВГеозону   = Дата(ВремяВхода);
			НоваяСтрока.ВыходИзГеозоны = Дата(ВремяВыхода);
			
			НоваяСтрока.ID_Автограф    = ID_Автограф;
			
			Если НЕ ВремяВгеозоне = "" Тогда
				НоваяСтрока.ВремяВгеозоне = Дата("0001.01.01 "+ВремяВГеозоне+":00");
			Иначе
				НоваяСтрока.ВремяВгеозоне = Дата("00010101000000");
			КонецЕсли;
			
			НоваяСтрока.СколькоТопливаПотрачено = РасходТоплива;
			НоваяСтрока.МотоЧасы = МотоЧасы;
			
			Если ЗначениеЗаполнено(Месторождение) Тогда
				НоваяСтрока.Месторождение = Месторождение;
				
				Если НЕ Объект.СторонняяТехника Тогда
					ГосНомерТС = ВернутьМашину(НомерТС);
					Если ГосНомерТС <> Справочники.уатТС.ПустаяСсылка() Тогда
						НоваяСтрока.ТС = ГосНомерТС;
					Иначе
						Сообщить("Строка № "+сч+" не нашли ТС по ""Гос.Номер"" в БД - "+ НомерТС);
						СтруктураОшибок.ТекстОшибки = СтруктураОшибок.ТекстОшибки + "Строка № " + сч + " Не нашли ТС по ""Гос.Номер"" в БД - "+ НомерТС;
					КонецЕсли;
				Иначе
					Если НомерТС <> "" Тогда
						НоваяСтрока.ТС = НомерТС;
					Иначе
						Сообщить("Строка № "+сч+" не заполнен номер ТС в файле Ecxel - " + НомерТС);
						СтруктураОшибок.ТекстОшибки = СтруктураОшибок.ТекстОшибки + "Строка № " + сч + " Не заполнен номер ТС в файле Ecxel - "+ НомерТС;
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Куст) Тогда
					СпрКуст = ВернутьЭлементКуст(СокрЛП(Куст),Месторождение);
					
					Если ЗначениеЗаполнено(СпрКуст) Тогда
						НоваяСтрока.Куст = СпрКуст;
					Иначе
						Сообщить("Строка № " + сч + " не нашли Куст " + Куст + " по Месторождениею в БД - " + Месторождение);
						СтруктураОшибок.ТекстОшибки = СтруктураОшибок.ТекстОшибки + "Строка № " + сч + " Не нашли Куст "+ Куст + " по Месторождениею в БД - " + Месторождение;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Найти(База,"База") > 0 Тогда
				Если НЕ Объект.СторонняяТехника Тогда
					ГосНомерТС = ВернутьМашину(НомерТС);
					Если ГосНомерТС <> Справочники.уатТС.ПустаяСсылка() Тогда
						НоваяСтрока.ТС = ГосНомерТС;
					Иначе
						Сообщить("Строка № " + сч + " не нашли ТС по ""Гос.Номер"" в БД - " + НомерТС);
						СтруктураОшибок.ТекстОшибки = СтруктураОшибок.ТекстОшибки + "Строка № " + сч + " Не нашли ТС по ""Гос.Номер"" в БД - " + НомерТС;
					КонецЕсли;
				Иначе
					Если НомерТС <> "" Тогда
						НоваяСтрока.ТС = НомерТС;
					Иначе
						Сообщить("Строка № " + сч + " не заполнен номер ТС в файле Ecxel - " + НомерТС);
						СтруктураОшибок.ТекстОшибки = СтруктураОшибок.ТекстОшибки + "Строка № " + сч + " Не заполнен номер ТС в файле Ecxel - " + НомерТС;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
				
			Если СтруктураОшибок.ТекстОшибки <> "" Тогда
				НоваяСтрока.ЕстьОшибки = Истина;
			Иначе 
				НоваяСтрока.ЕстьОшибки = Ложь;
			КонецЕсли;
			
			НоваяСтрока.ОписаниеОшибки = СтруктураОшибок.ТекстОшибки;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИнформации(Команда)	
	
	Если Объект.ТЧ.Количество() = 0 Тогда 
		НачатьЗагрузку();
	Иначе
		Оповещение = Новый ОписаниеОповещения("ЗагрузкаИнформацииИзExcel", ЭтотОбъект);
		
		ПоказатьВопрос(Оповещение,"Табличная часть будет очищена, продолжить загрузку???",РежимДиалогаВопрос.ДаНет,,,"Внимание!!!",);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаИнформацииИзExcel(Результат, Параметры) Экспорт	
	
	Если Результат = КодВозвратаДиалога.Да Тогда	
		Объект.ТЧ.Очистить();
		НачатьЗагрузку();		
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьЗагрузку()
	
	ДиалогВыбора=Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = "Выберите файл с данными ";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбора.Фильтр = "Excel (*.xls, *.xlsx)|*.xls*|Все файлы (*.*)|*.*";
	
	Если ДиалогВыбора.Выбрать() Тогда
		ФайлExcel = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
	Двоичные = Новый ДвоичныеДанные(ФайлExcel);
	Адрес = ПоместитьВоВременноеХранилище(Двоичные, ЭтаФорма.УникальныйИдентификатор);
	
	ОчиститьСообщения();
	
	ЗагрузкаИнформацииНаСервере(Адрес);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОшибки(Команда)
	
	Если Объект.ТЧ.Количество()>0 Тогда
		
		Отбор = Новый Структура("ЕстьОшибки",Истина);
		МассивСтрок = Объект.ТЧ.НайтиСтроки(Отбор);
		
		Если МассивСтрок.Количество() >0 Тогда
			МассивОшибок = Новый Массив;
			Для каждого СтрМ Из МассивСтрок Цикл
				МассивОшибок.Добавить(СтрМ.ОписаниеОшибки);
			КонецЦикла;
			
			СтрСоеденим = СтрСоединить(МассивОшибок, "/");
			Ошибки = СтрЗаменить(СтрСоеденим,"/",Символы.ПС);
		Иначе
			Сообщить("Ошибок не обнаружено");
		КонецЕсли;
	Иначе
		Сообщить("Сначала необходимо загрузить информацию по геозонам!");
	КонецЕсли;
	
	Если Ошибки <> Неопределено Тогда
		ПоказатьЗначение(, Ошибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВБухгалтерию(Команда)
	
	Если Объект.ТЧ.Количество() > 0 Тогда
		ОписаниеОповещение = Новый ОписаниеОповещения("ОтправитьЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещение,"Вы действительно хотите отправить в бухгалтерию?",РежимДиалогаВопрос.ДаНет,,,"Внимание!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗавершение(Знач Результат, Знач ДополнительныеПараметры) Экспорт
	                                            
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если НЕ Объект.Проведен Тогда
			ПоказатьПредупреждение(,"Перед отправкой необходимо провести документ!",,"Внимание!!!");
			Возврат;
		КонецЕсли;
		
		Если ПроверимПустыеСсылкиТС() Тогда
			ПоказатьПредупреждение(,"Перед отправкой необходимо заполнить ТС!",,"Внимание!!!");
			Возврат;	
		КонецЕсли;
		
		Если ПроверимПустыеТС() Тогда
			ПоказатьПредупреждение(,"Перед отправкой необходимо заполнить ТС!",,"Внимание!!!");
			Возврат;	
		КонецЕсли;
				
		ОтправитьВБухгалтериюНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьВБухгалтериюНаСервере()
	

	СоединениеWS = GDS_ФункцииОбмена.ПолучитьДанныеОWS_БП();
	
	ТекстОшибки = "";
	
	XML_Строка = GDS_ФункцииОбмена.СерилизацияДокумента(Объект);
	
	Данные = Новый ХранилищеЗначения(XML_Строка, Новый СжатиеДанных(9));
	
	Попытка
		Результат = СоединениеWS.ПринятьДанные(Данные,ТекстОшибки);
	Исключение
	КонецПопытки;
	
	если Результат <> 1 ИЛИ Результат <> Истина тогда
		Сообщить("Не удалось выгрузить документ Местонахождение техники из УАТ",СтатусСообщения.ОченьВажное);
	Иначе
		Объект.Отправлен = Истина;
		Записать();
	конецЕсли;

	
КонецПроцедуры

&НаСервере
Функция ПроверимПустыеОС()
	
	СтруктураДляПоиска = Новый Структура("ОС", Справочники.ОсновныеСредства.ПустаяСсылка());
	
	ТабличнаяЧастьДок = Объект.ТЧ; 
	//Получаем список строк соответсвтвующих отбору. 
	
	МассивСтрок = ТабличнаяЧастьДок.НайтиСтроки(СтруктураДляПоиска); 
	
	Если МассивСтрок.Количество() > 0 Тогда
		Возврат Истина;
	Иначе	
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверимПустыеСсылкиТС()
	
	СтруктураДляПоиска = Новый Структура("ТС", Справочники.уатТС.ПустаяСсылка());
	
	ТабличнаяЧастьДок = Объект.ТЧ; 
	//Получаем список строк соответсвтвующих отбору. 
	
	МассивСтрок = ТабличнаяЧастьДок.НайтиСтроки(СтруктураДляПоиска); 
	
	Если МассивСтрок.Количество() > 0 Тогда
		Для каждого СтрМ Из МассивСтрок Цикл
			Сообщить("В строке № "+СтрМ.НомерСтроки+ " необходимо заполнить ТС",СтатусСообщения.Информация);
		КонецЦикла;
		
		Возврат Истина;
	Иначе	
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверимПустыеТС()
	
	СтруктураДляПоиска = Новый Структура("ТС", Неопределено);
	
	ТабличнаяЧастьДок = Объект.ТЧ; 
	//Получаем список строк соответсвтвующих отбору. 
	
	МассивСтрок = ТабличнаяЧастьДок.НайтиСтроки(СтруктураДляПоиска); 
	
	Если МассивСтрок.Количество() > 0 Тогда
		Для каждого СтрМ Из МассивСтрок Цикл
			Сообщить("В строке № "+СтрМ.НомерСтроки+ " необходимо заполнить ТС",СтатусСообщения.Информация);
		КонецЦикла;
		
		Возврат Истина;
	Иначе	
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверкаМассиваСтрокНаДвойныеКусты(МассивСтрок)
	
	СтруктураДублей = Новый Структура;
	СтруктураДублей.Вставить("Месторождение","");
	СтруктураДублей.Вставить("Кусты","");
	
	МассивДублей = Новый Массив;
	
	ДублиКустов   = "";
	Месторождение = "";
	
	//определение дублей кустов
	Для СтрМассива = 0 по МассивСтрок.Количество() - 1 Цикл
		СтрМасс = МассивСтрок[СтрМассива];
		
		Если Найти(СокрЛП(СтрМасс),"К-") > 0 Тогда
			МассивДублей.Добавить(Прав(СокрЛП(СтрМасс),СтрДлина(СокрЛП(СтрМасс))-2));
		ИначеЕсли Найти(СокрЛП(СтрМасс)," К-") > 0 Тогда
			МассивДублей.Добавить(Прав(СокрЛП(СтрМасс),СтрДлина(СокрЛП(СтрМасс))-2)); 	
		КонецЕсли;	
	КонецЦикла;
	
	//определением месторождения
	Для СтрМассива = 0 по МассивСтрок.Количество() - 1 Цикл
		СтрМасс = МассивСтрок[СтрМассива];
			
		Если Найти(СокрЛП(СтрМасс),"м/р") > 0 Тогда
			Местор = СокрЛП(Лев(СокрЛП(СтрМасс),СтрДлина(СокрЛП(СтрМасс))-4));
			Месторождение = ВернутьЭлементМесторождение(Местор);
		КонецЕсли;		

	КонецЦикла;

	Если МассивДублей.Количество() > 1 Тогда
		ДублиКустов = СтрСоединить(МассивДублей, "-");	
	КонецЕсли;
	
	СтруктураДублей.Вставить("Месторождение",Месторождение);
	СтруктураДублей.Вставить("Кусты",ДублиКустов);
	
	Возврат СтруктураДублей;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПараметрыСеанса.АвторизованныйПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()

	Для Каждого СтрТЧ Из Объект.ТЧ Цикл
		Если ТипЗнч(СтрТЧ.ТС) <> Тип("Строка")
			и ТипЗнч(СтрТЧ.ТС) <> Тип("Неопределено") Тогда
			
			СтрТЧ.ОС = СтрТЧ.ТС.ОсновноеСредство;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ТЧ.Количество() > 0 Тогда
		ПриОткрытииНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

Функция ВернутьЗначениеЗагрузкиПоНаименованию(НаименованиеЗначения, ТипЗначения) Экспорт
	ЭлементВозврата = "";
	ИмяТипа = Метаданные.Перечисления["GDS_ТипЗагружаемогоЭлемента"].ЗначенияПеречисления[Перечисления["GDS_ТипЗагружаемогоЭлемента"].Индекс(ТипЗначения)].Имя;
	
	ЭлементВозврата  = Справочники[ИмяТипа].НайтиПоНаименованию(НаименованиеЗначения,Истина);
		
	Если Не ЗначениеЗаполнено(ЭлементВозврата) ТОгда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	GDS_МестонахождениеТехники_ПравилаЗагрузки.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.GDS_МестонахождениеТехники_ПравилаЗагрузки КАК GDS_МестонахождениеТехники_ПравилаЗагрузки
		|ГДЕ
		|	GDS_МестонахождениеТехники_ПравилаЗагрузки.НаименованиеЭлемента = &НаименованиеЭлемента
		|	И GDS_МестонахождениеТехники_ПравилаЗагрузки.ТипЗагружаемогоЭлемента = &ТипЗагружаемогоЭлемента";
		
		Запрос.УстановитьПараметр("НаименованиеЭлемента", НаименованиеЗначения);
		Запрос.УстановитьПараметр("ТипЗагружаемогоЭлемента", ТипЗначения);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЭлементВозврата = ВыборкаДетальныеЗаписи.Значение;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ЭлементВозврата;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ТЧ.Количество()>0 Тогда	
		ЗаполнениеПУвТЧ();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнениеПУвТЧ();
	
	//собирем все данные по ТС в одну таблицу
	ТЗ_Геозоны = Объект.ТЧ.Выгрузить();
	
	ТЗ_ТС_Свернуть = ТЗ_Геозоны.Скопировать();
	
	ТЗ_ТС_Свернуть.Свернуть("ТС");
	
	ТЗ_ТС = ТЗ_ТС_Свернуть.ВыгрузитьКолонку("ТС");
	
	Для Каждого СтрТС Из ТЗ_ТС Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ТС",СтрТС);
		
		МассивДанных = ТЗ_Геозоны.НайтиСтроки(Отбор);
		
		//Переведем из массива в ТЗ
		НоваяТЗ.Очистить();
		
		Для Каждого СтрМ Из МассивДанных Цикл
			НоваяСтрока = НоваяТЗ.Добавить();
			
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрМ);			
		КонецЦикла;
		
		Для Каждого СтрТЗ Из НоваяТЗ Цикл
			ИндексТекСтроки = НоваяТЗ.Индекс(СтрТЗ);
			ВсегоСтрок		= НоваяТЗ.Количество();
			
			ПредСтрока = ?(ИндексТекСтроки, НоваяТЗ[ИндексТекСтроки-1], Неопределено);
			
			СледСтрока = ?(ИндексТекСтроки < ВсегоСтрок-1, НоваяТЗ[ИндексТекСтроки+1], Неопределено);
			
			ПУ = "";
			
			//если нет месторождения, куста и заполнена база значит машина выехала с базы тобишь с ПУ
			//определим ПУ и дальше заполним его по маршруту
			Если (СтрТЗ.Месторождение = Справочники.GDS_Месторождения.ПустаяСсылка()  
				или СтрТЗ.Куст = Справочники.GDS_Кусты.ПустаяСсылка()) 
				и СтрТЗ.База <> "" Тогда
					
				ПУ = ОпределениеПУ(СтрТЗ.База);
				
				НоваяТЗ[ИндексТекСтроки].ПУ = ПУ;
				
			Иначе	
				Если ПредСтрока <> Неопределено
						И ПредСтрока.ПУ <> Справочники.уатКолонны.ПустаяСсылка() Тогда	
					
					НоваяТЗ[ИндексТекСтроки].ПУ = ПредСтрока.ПУ;					
				КонецЕсли;
			КонецЕсли;	
		КонецЦикла;
		
		//дополним данными эталонную ТЧ
		сс="";
		
		Для Каждого СтрокаТЗ Из НоваяТЗ Цикл
	
			Отбор = Новый Структура;
			Отбор.Вставить("НомерСтроки",СтрокаТЗ.НомерСтроки);
			
			СтрокаПоиска = Объект.ТЧ.НайтиСтроки(Отбор);
			
			СтрокаПоиска[0].ПУ = СтрокаТЗ.ПУ;
			
		КонецЦикла;
		
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция ОпределениеПУ(База)
	ПУ = "";
	
	Если СтрНайти(База,"База ЗАО СП МеКаМинефть") > 0 Тогда
		
		ДлинаБазы = СтрДлина("База ЗАО СП МеКаМинефть");
		
		ПолучилиГород = СокрЛП(Сред(База,ДлинаБазы+1));
		
		Если ПолучилиГород = "г.Советский" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000044");//ПУ 23 Урай (ГРП)
		ИначеЕсли ПолучилиГород = "г.Бузулук" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000048");//ПУ 20 г. Оренбург
		ИначеЕсли ПолучилиГород = "г.Лангепас" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000046");//ПУ 25 Лангепас (ГРП)
		ИначеЕсли ПолучилиГород = "г.Оренбург" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000048");//ПУ 20 г. Оренбург
		ИначеЕсли ПолучилиГород = "г.Оса" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000043");//ПУ 22 Пермь (ГРП)
		ИначеЕсли ПолучилиГород = "г.Пыть - Ях" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000034");//ПУ 3 г. Нефтеюганск Пыть-Ях
		ИначеЕсли ПолучилиГород = "Гальяновское мр" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000020");//ПУ 41 Назым (ГРП)
		ИначеЕсли ПолучилиГород = "Мегион" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000031");//ПУ 14 г. Мегион (ГРП)
		ИначеЕсли ПолучилиГород = "Новый порт" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000030");//ПУ 15 Новый Порт (ГРП)
		ИначеЕсли ПолучилиГород = "Новый Уренгой" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000022");//ПУ 42 Арктикгаз (ГРП)
		ИначеЕсли ПолучилиГород = "п.Бураево" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000043");//ПУ 22 Пермь (ГРП)
		ИначеЕсли ПолучилиГород = "Покачи" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000036");//ПУ 4 г. Покачи (ГРП)
		ИначеЕсли ПолучилиГород = "ПУ Ангара" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000014");//ПУ 38 Ангара
		ИначеЕсли ПолучилиГород = "ПУ Самотлор" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000003");//ПУ 30 Самотлор
		ИначеЕсли ПолучилиГород = "Ср-Назымское мр" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000020");//ПУ 41 Назым (ГРП)
		ИначеЕсли ПолучилиГород = "Южная Приобка" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000000040");//ПУ 1 г. Ханты -М (ГРП)		
		КонецЕсли;
		
	ИначеЕсли СтрНайти(База,"База ООО Ситек-Транс") > 0 Тогда 
		
		ДлинаБазы = СтрДлина("База ООО Ситек-Транс");
		
		ПолучилиГород = СокрЛП(Сред(База,ДлинаБазы+1));
		
		Если ПолучилиГород = "г.Нижневартовск" Тогда
			ПУ = Справочники.уатКолонны.НайтиПоКоду("000");//Общие расходы 
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат ПУ;
КонецФункции
